---
kind: method
id: M:Autodesk.Revit.DB.XYZ.Negate
zh: 点
source: html/a49329de-862d-cdfd-4154-6260a74507a1.htm
---
# Autodesk.Revit.DB.XYZ.Negate Method

**中文**: 点

Negates this vector.

## Syntax (C#)
```csharp
public XYZ Negate()
```

## Returns
The vector opposite to this vector.

## Remarks
The negated vector is obtained by changing the sign of each coordinate
of this vector.